src/main/resources/createEntity

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://rice.kuali.org/kim/v2_0">
    <soapenv:Header/>
    <soapenv:Body>
        <v2:createEntity>
            <!--Optional:-->
            <v2:entity>
                <!--Optional:-->
                <v2:id>U222222222</v2:id>
                <!--Optional:-->
                <v2:principals>
                    <!--Zero or more repetitions:-->
                    <v2:principal>
                        <!--Optional:-->
                        <v2:principalId>U222222222</v2:principalId>
                        <!--Optional:-->
                        <v2:principalName>bombbumbhole</v2:principalName>
                        <!--Optional:-->

                        <v2:active></v2:active>

                    </v2:principal>
                </v2:principals>

            </v2:entity>
        </v2:createEntity>
    </soapenv:Body>
</soapenv:Envelope>